movingMesh/2D/src/system/snappyHexMeshSrc/eMeshList
{
    file "splittedChannel.eMesh";
    level 0;
}
