movingMesh/2D/src/system/snappyHexMeshSrc/refinementSurfacesList
splittedChannelWalls
{
    level (0 0);
    patchInfo{type wall;}
}
